#include <iostream>

/*
Хипопотамчето Теди също е на математика и днес ще пише хеширащи функции (набързо обяснено: хващаме някакъв обект, например текст, и след някакви черни магии то се превръща в число). За да използва дадено число n в тази функция, числото n трябва да бъде просто. За съжаление, Теди не се чувства добре, затова му помогнете, като напишете програма, която проверява дали дадено число е просто.
*/

int main ()
{
    int n;

    std::cin >> n;

    int counter = 0;
    for (std::size_t i = 1; i <= n; ++i)
    {
        if (n % i == 0)
        {
            ++counter;
        }
    }

    if (counter == 2)
    {
        std::cout << "The number is prime" << std::endl;
    }
    else
    {
        std::cout << "The number isn't prime" << std::endl;
    }

    return 0;
}