# Увод в програмирането - практикум 2022/2023
Здравейте, 

Тук ще намерите заданията, които се дават по време на практикумите. Решенията на задачите, ще се качват след седмица, за да имате време сами да поработите преди това.

Ако имате нужда, не се притеснявайте да ни потърсите на съответните места долу.

## Контакти
|               | Vesi          | Vasi  |
| ------------- |:-------------:| :-----:|
| Email      | vtvelkova@uni-sofia.bg      |   fn82183@g.fmi.uni-sofia.bg |
| Facebook      | [Veselina Velkova](https://www.facebook.com/profile.php?id=100005986579138) | [Vasilena Krazheva](https://www.facebook.com/vasilena.krazheva) |